package thread.test;

public class Test01 {
    public static void main(String[] args) {
//        1. 동물원
//        다음 조건을 Runnable 인터페이스를 구현해서 작성하세요.
//
//        동물원에 동물 3마리가 있다.
//        각 동물들은 1초에 한 번씩 울음소리를 낸다.
//                항상 2마리의 동물이 먼저 울고 남은 한 마리가 나중에 운다.
//                각 동물은 5번씩만 울고 잠에 든다.
//
//        출력 예시
//
//        어흥
//        음메~
//                음메~
//                어흥
//        어흥
//        음메~
//                음메~
//                어흥
//        음메~
//                어흥
//        히잉
//                히잉
//        히잉
//                히잉
//        히잉
    }
}
